//### Перечень интерфейсов:

//- **WorkBaseTime** - расчет оплаты
//исходя из отработанного времени.

  //- **calcBase** - метод расчета зарплаты
  //исходя из оклада (за час) и отработанных часов

  //- **calcBonus** - дополнительные выплаты

//- **ProjectBudget** - расчет оплаты
//исходя из участия в проекте
//(бюджет проекта делится
//  пропорционально персональному вкладу).

  //- **calcBudgetPart** - расчет выплат
  //из бюджета проекта

  //- **calcProAdditions** - расчет *бонусных* выплат

//- **Heading** - расчет оплаты
//исходя из руководства (количество подчиненных).
